app/Controllers/Admin/Pelatihan.php

    public function index()
    {
        $model = new PelatihanModel();

        // Ambil parameter pencarian
        $search = $this->request->getGet('search');
        $filterAkses = $this->request->getGet('akses');

        // Query dasar dengan join user
        $builder = $model->select('pelatihan.*, user.nama as user_nama')
            ->join('user', 'user.id = pelatihan.user_id');

        // Tambahkan kondisi pencarian jika ada
        if (!empty($search)) {
            $builder->groupStart()
                ->like('pelatihan.judul', $search)
                ->orLike('pelatihan.caption_pelatihan', $search)
                ->orLike('user.nama', $search)
                ->groupEnd();
        }

        // Tambahkan filter akses publik jika ada
        if ($filterAkses !== null && $filterAkses !== '') {
            $builder->where('pelatihan.akses_publik', $filterAkses);
        }

        // Pagination
        $data = [
            'pelatihan' => $builder->orderBy('pelatihan.created_at', 'DESC')->paginate(10),
            'pager' => $model->pager,
            'search' => $search,
            'filterAkses' => $filterAkses
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `pelatihan`
JOIN `user` ON `user`.`id` = `pelatihan`.`user_id`
SELECT `pelatihan`.*, `user`.`nama` as `user_nama`
FROM `pelatihan`
JOIN `user` ON `user`.`id` = `pelatihan`.`user_id`
ORDER BY `pelatihan`.`created_at` DESC
 LIMIT 10