app/Controllers/Admin/Pengetahuan.php

    public function index()
    {
        $model = new PengetahuanModel();

        // Ambil parameter pencarian
        $search = $this->request->getGet('search');
        $filterAkses = $this->request->getGet('akses');

        // Query dasar dengan join user
        $builder = $model->select('pengetahuan.*, user.nama as user_nama')
            ->join('user', 'user.id = pengetahuan.user_id');

        // Tambahkan kondisi pencarian jika ada
        if (!empty($search)) {
            $builder->groupStart()
                ->like('pengetahuan.judul', $search)
                ->orLike('pengetahuan.caption_pengetahuan', $search)
                ->orLike('user.nama', $search)
                ->groupEnd();
        }

        // Tambahkan filter akses publik jika ada
        if ($filterAkses !== null && $filterAkses !== '') {
            $builder->where('pengetahuan.akses_publik', $filterAkses);
        }

        // Pagination
        $data = [
            'pengetahuan' => $builder->orderBy('pengetahuan.created_at', 'DESC')->paginate(10),
            'pager' => $model->pager,
            'search' => $search,
            'filterAkses' => $filterAkses
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `pengetahuan`
JOIN `user` ON `user`.`id` = `pengetahuan`.`user_id`
SELECT `pengetahuan`.*, `user`.`nama` as `user_nama`
FROM `pengetahuan`
JOIN `user` ON `user`.`id` = `pengetahuan`.`user_id`
ORDER BY `pengetahuan`.`created_at` DESC
 LIMIT 10