app/Controllers/Admin/Template.php

    public function index()
    {
        $model = new TemplateModel();

        // Ambil parameter pencarian
        $search = $this->request->getGet('search');
        $filterAkses = $this->request->getGet('akses');

        // Query dasar dengan join user
        $builder = $model->select('template.*, user.nama as user_nama')
            ->join('user', 'user.id = template.user_id');

        // Tambahkan kondisi pencarian jika ada
        if (!empty($search)) {
            $builder->groupStart()
                ->like('template.judul', $search)
                ->orLike('user.nama', $search)
                ->groupEnd();
        }

        // Tambahkan filter akses publik jika ada
        if ($filterAkses !== null && $filterAkses !== '') {
            $builder->where('template.akses_publik', $filterAkses);
        }

        // Pagination
        $data = [
            'template' => $builder->orderBy('template.created_at', 'DESC')->paginate(10),
            'pager' => $model->pager,
            'search' => $search,
            'filterAkses' => $filterAkses
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `template`
JOIN `user` ON `user`.`id` = `template`.`user_id`
SELECT `template`.*, `user`.`nama` as `user_nama`
FROM `template`
JOIN `user` ON `user`.`id` = `template`.`user_id`
ORDER BY `template`.`created_at` DESC
 LIMIT 10