app/Controllers/Admin/User.php

    public function index()
    {
        // Cek level admin
        if (session()->get('level') != 'admin') {
            return redirect()->to('/login')->with('error', 'Akses ditolak');
        }

        $search = $this->request->getGet('search');
        $filterLevel = $this->request->getGet('level'); // ambil filter level dari form

        $userModel = new \App\Models\UserModel();
        $query = $userModel;

        if ($search) {
            $users = $this->userModel->getUserWithSearch($search)->paginate(10);
        } else {
            $users = $this->userModel->paginate(10);
---
SELECT *
FROM `user`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `user`