app/Controllers/Pegawai/Pengetahuan.php

SELECT COUNT(*) AS `numrows`
FROM `pengetahuan`
JOIN `user` ON `user`.`id` = `pengetahuan`.`user_id`
SELECT `pengetahuan`.*, `user`.`nama` as `user_nama`
FROM `pengetahuan`
JOIN `user` ON `user`.`id` = `pengetahuan`.`user_id`
ORDER BY `pengetahuan`.`created_at` DESC
 LIMIT 10
---
    public function index()
    {
        $model = new PengetahuanModel();

        // Ambil parameter pencarian
        $search = $this->request->getGet('search');
        $filterAkses = $this->request->getGet('akses');

        // Query dasar dengan join user
        $builder = $model->select('pengetahuan.*, user.nama as user_nama')
            ->join('user', 'user.id = pengetahuan.user_id');

        // Tambahkan kondisi pencarian jika ada
        if (!empty($search)) {
            $builder->groupStart()
                ->like('pengetahuan.judul', $search)
                ->orLike('pengetahuan.caption_pengetahuan', $search)
                ->orLike('user.nama', $search)
                ->groupEnd();
        }

        // Tambahkan filter akses publik jika ada
        if ($filterAkses !== null && $filterAkses !== '') {
            $builder->where('pengetahuan.akses_publik', $filterAkses);
        }

        // Pagination
        $data = [
            'pengetahuan' => $builder->orderBy('pengetahuan.created_at', 'DESC')->paginate(10),
            'pager' => $model->pager,
            'search' => $search,
            'filterAkses' => $filterAkses
        ];

INSERT INTO `pengetahuan` (`judul`, `file_pdf_pengetahuan`, `thumbnail_pengetahuan`, `caption_pengetahuan`, `akses_publik`, `user_id`, `created_at`, `updated_at`) VALUES ('19 OKT 2025 - SKRIPSI AI YULIA SAFITRI', '5519_s03-_formulir_bimbingan_skripsi_ai_yulia.pdf', NULL, '', 0, '48', '2025-10-20 21:42:20', '2025-10-20 21:42:20')
---
        }

        // Simpan ke database
        $this->pengetahuanModel->save([
            'judul'                => $this->request->getVar('judul'),
            'file_pdf_pengetahuan' => $namaPdf,
            'thumbnail_pengetahuan' => $namaThumbnail, // bisa null
            'caption_pengetahuan'  => $this->request->getVar('caption'),
            'akses_publik'         => $this->request->getVar('akses_publik') ? 1 : 0,
            'user_id'              => session()->get('id')
        ]);

SELECT *
FROM `pengetahuan`
WHERE `pengetahuan`.`id` = '84'
DELETE FROM `pengetahuan`
WHERE `id` IN ('84')
---
    public function delete($id)
    {
        $pengetahuan = $this->pengetahuanModel->find($id);

        // Hapus file PDF jika ada
        $pdfPath = 'assets/uploads/pengetahuan/' . $pengetahuan['file_pdf_pengetahuan'];
        if (!empty($pengetahuan['file_pdf_pengetahuan']) && file_exists($pdfPath)) {
            unlink($pdfPath);
        }

        // Hapus thumbnail jika bukan default dan file-nya ada
        $thumbnailPath = 'assets/uploads/pengetahuan/' . $pengetahuan['thumbnail_pengetahuan'];
        if (
            !empty($pengetahuan['thumbnail_pengetahuan']) &&
            $pengetahuan['thumbnail_pengetahuan'] != 'default.jpg' &&
            file_exists($thumbnailPath)
        ) {
            unlink($thumbnailPath);
        }

        // Hapus data dari database
        $this->pengetahuanModel->delete($id);

SELECT *
FROM `pengetahuan`
WHERE `id` != '76'
 LIMIT 5
---
    public function view($id)
    {
        $pengetahuanModel = new PengetahuanModel();
        $komentarModel    = new \App\Models\KomentarPengetahuanModel();

        // Ambil data pengetahuan utama
        $pengetahuan = $pengetahuanModel->getPengetahuanWithUserById($id);

        if (!$pengetahuan) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound(
                "Pengetahuan dengan ID $id tidak ditemukan"
            );
        }

        // Ambil pengetahuan lain selain ID ini (maksimal 5 data)
        $pengetahuanLain = $pengetahuanModel
            ->where('id !=', $id)
            ->findAll(5);