app/Controllers/Auth.php

SELECT *
FROM `user`
WHERE `email` = 'darinkb@mail.com'
 LIMIT 1
---
    public function attemptLogin()
    {
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        // Validasi input
        if (empty($email) || empty($password)) {
            return redirect()->back()->withInput()->with('error', 'Email dan password harus diisi');
        }

        // Cari user berdasarkan email
        $user = $this->userModel->where('email', $email)->first();