app/Controllers/Beranda.php

    public function index()
    {
        $data = [
            'title'              => 'Beranda',
            'pengetahuan'        => $this->pengetahuanModel->getPublicPengetahuan(5), // Ambil 5 terbaru
            'pelatihan'          => $this->pelatihanModel->getPublicPelatihan(5),     // Ambil 5 terbaru
            'total_pengetahuan'  => $this->pengetahuanModel->countAll(),
            'total_pelatihan'    => $this->pelatihanModel->countAll(),
            'total_pengguna'     => $this->userModel->countAllResults(),
            'total_pengajuan'    => $this->pengajuanModel->countAllResults(),
            'pengetahuan_terbaru' => $this->pengetahuanModel->orderBy('created_at', 'DESC')->findAll(5),
            'pelatihan_terbaru'  => $this->pelatihanModel->orderBy('created_at', 'DESC')->findAll(5),
---
SELECT COUNT(*) AS `numrows` FROM `pengetahuan`
SELECT COUNT(*) AS `numrows` FROM `pelatihan`
SELECT COUNT(*) AS `numrows`
FROM `user`
SELECT COUNT(*) AS `numrows`
FROM `pengajuan`
SELECT *
FROM `pengetahuan`
ORDER BY `created_at` DESC
 LIMIT 5
SELECT *
FROM `pelatihan`
ORDER BY `created_at` DESC
 LIMIT 5