app/Controllers/Pelatihan.php

SELECT *
FROM `pelatihan`
WHERE `id` != '47'
AND `akses_publik` = 1
ORDER BY `created_at` DESC
 LIMIT 6
---
    public function view($id)
    {
        $pelatihanModel = new PelatihanModel();
        $komentarModel    = new \App\Models\KomentarPelatihanModel();

        // Ambil data pelatihan utama
        $pelatihan = $pelatihanModel->getPelatihanWithUserById($id);

        if (!$pelatihan) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound(
                "Pelatihan dengan ID $id tidak ditemukan"
            );
        }

        // Ambil pelatihan lain selain ID ini (maksimal 5 data)
        $pelatihanLain = $pelatihanModel
            ->where('id !=', $id)
            ->where('akses_publik', 1)
            ->orderBy('created_at', 'DESC')
            ->findAll(6); // Ambil maksimal 6 pengetahuan lain