app/Models/KomentarPengetahuanModel.php

SELECT `komentar_pengetahuan`.*, `user`.`nama` as `user_nama`, `user`.`id` as `user_id`
FROM `komentar_pengetahuan`
JOIN `user` ON `user`.`id` = `komentar_pengetahuan`.`user_id`
WHERE `pengetahuan_id` = '76'
AND `parent_id` IS NULL
ORDER BY `created_at` DESC
---
    public function getKomentarByPengetahuan($pengetahuan_id)
    {
        return $this->select('komentar_pengetahuan.*, user.nama as user_nama, user.id as user_id')
            ->join('user', 'user.id = komentar_pengetahuan.user_id')
            ->where('pengetahuan_id', $pengetahuan_id)
            ->where('parent_id IS NULL') // Hanya komentar utama
            ->orderBy('created_at', 'DESC')
            ->findAll();