app/Models/KomentarPelatihanModel.php

    public function getKomentarByPelatihan($pelatihan_id)
    {
        return $this->select('komentar_pelatihan.*, user.nama as user_nama, user.id as user_id')
            ->join('user', 'user.id = komentar_pelatihan.user_id')
            ->where('pelatihan_id', $pelatihan_id)
            ->where('parent_id IS NULL') // Hanya komentar utama
            ->orderBy('created_at', 'DESC')
            ->findAll();
---
SELECT `komentar_pelatihan`.*, `user`.`nama` as `user_nama`, `user`.`id` as `user_id`
FROM `komentar_pelatihan`
JOIN `user` ON `user`.`id` = `komentar_pelatihan`.`user_id`
WHERE `pelatihan_id` = '47'
AND `parent_id` IS NULL
ORDER BY `created_at` DESC