app/Models/PelatihanModel.php

SELECT `pelatihan`.*, IFNULL(user.nama, "Tidak diketahui") as user_nama
FROM `pelatihan`
LEFT JOIN `user` ON `user`.`id` = `pelatihan`.`user_id`
WHERE `pelatihan`.`id` = '47'
---
    public function getPelatihanWithUserById($id)
    {
        $builder = $this->db->table($this->table)
            ->select('pelatihan.*, IFNULL(user.nama, "Tidak diketahui") as user_nama')
            ->join('user', 'user.id = pelatihan.user_id', 'left')
            ->where('pelatihan.id', $id);

        $result = $builder->get()->getRowArray();

SELECT *
FROM `pelatihan`
 LIMIT 9
SELECT COUNT(*) AS `numrows`
FROM `pelatihan`
---
    public function getPelatihanWithSearch($keyword = null, $perPage = 9)
    {
        $builder = $this->table($this->table);

        if (!empty($keyword)) {
            $builder->groupStart()
                ->like('judul', $keyword)
                ->orLike('caption_pelatihan', $keyword)
                ->groupEnd();
        }

        return $builder->paginate($perPage);

SELECT *
FROM `pelatihan`
WHERE `akses_publik` = 1
ORDER BY `created_at` DESC
 LIMIT 5
---
    public function getPublicPelatihan($limit = null)
    {
        $builder = $this->where('akses_publik', 1)
            ->orderBy('created_at', 'DESC');

        if ($limit) {
            $builder->limit($limit);
        }

        return $builder->findAll();