app/Models/PengajuanModel.php

    public function getAllPengajuan()
    {
        // Ambil semua data diurutkan dari yang terbaru
        return $this->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `pengajuan`
ORDER BY `created_at` DESC