app/Models/PengetahuanModel.php

    public function getPengetahuanWithSearch($keyword = null, $perPage = 9)
    {
        $builder = $this->table($this->table);

        if (!empty($keyword)) {
            $builder->groupStart()
                ->like('judul', $keyword)
                ->orLike('caption_pengetahuan', $keyword)
                ->groupEnd();
        }

        return $builder->paginate($perPage);
---
SELECT *
FROM `pengetahuan`
 LIMIT 9
SELECT COUNT(*) AS `numrows`
FROM `pengetahuan`

    public function getPublicPengetahuan($limit = null)
    {
        $query = $this->where('akses_publik', 1)
            ->orderBy('created_at', 'DESC');

        if ($limit) {
            $query->limit($limit);
        }

        return $query->findAll();
---
SELECT *
FROM `pengetahuan`
WHERE `akses_publik` = 1
ORDER BY `created_at` DESC
 LIMIT 5