app/Models/UserModel.php

SELECT `id`, `username`, `email`, `level`, `nama`, `nik`, `no_hp`, `alamat`, `unit_kerja`, `created_at`, `updated_at`
FROM `user`
WHERE `id` = 1
 LIMIT 1
---
    public function getUserById($id)
    {
        // Validasi ID
        if (!is_numeric($id)) {
            throw new \InvalidArgumentException('ID harus berupa angka');
        }

        // Dapatkan user dengan proteksi terhadap SQL injection
        $user = $this->where('id', (int)$id)
            ->select('id, username, email, level, nama, nik, no_hp, alamat, unit_kerja, created_at, updated_at')
            ->first();